Repository: AhmedShawkyAhmed/SedaDriver
Catalog: lib/src/constants/localization/l10n/app_*.arb
Languages: ar

source: Login
ar: تسجيل الدخول

# loginGreeting
source: Login To Your Account
ar: تسجيل الدخول إلى حسابك

source: Phone Number
ar: رقم التليفون

source: Phone Number required!
ar: رقم الهاتف مطلوب!

# phoneNumberShort
source: Short Phone Number!
ar: رقم هاتف قصير!

# socialLogin
source: or sign in with social
ar: أو تسجيل الدخول مع وسائل التواصل الاجتماعي

source: Phone Verification
ar: التحقق من الهاتف

# enterVerificationCode
source: Please Enter the verification code
ar: الرجاء إدخال رمز التحقق

# enter4Digits
source: Please enter the 6 digital code sent to your mobile number
ar: الرجاء إدخال ال 6 ارقام المرسلة إلى رقم هاتفك المحمول

# invalidVerificationCode
source: The code you entered is not valid
ar: الرمز الذي أدخلته غير صالح

source: Resend code
ar: أعد إرسال الرمز

# continueT
source: Continue
ar: استمر

source: Verification Code required!
ar: رمز التحقق مطلوب!

# minutesLeft
source: {value} minutes left
ar: {value} دقائق مضت

# invalidSendCode
source: You must wait 2 minutes to resend the code
ar: يجب أن تنتظر دقيقتين لإعادة إرسال الرمز

source: Basic Info
ar: معلومات أساسية

# carLicensePhoto
source: Photo of car license
ar: صورة رخصة السيارة

source: Certificate of good conduct
ar: شهادة حسن السيرة والسلوك

source: National ID
ar: الهوية الوطنية

source: Registration
ar: التسجيل

# fillRequiredFields
source: You have to fill all required fields!
ar: عليك ملء جميع الحقول المطلوبة!

# registerText1
source: By Register You agree on The
ar: بالتسجيل فإنك توافق على

# registerText2
source: Terms and Conditions,
ar: الشروط والأحكام

# registerText3
source: I acknowledge and agree with processing and transfer of personal data according to conditions of
ar: أقر وأوافق على معالجة البيانات الشخصية ونقلها وفقًا لشروط

# registerText4
source: Privacy Policy
ar: سياسة الخصوصية

source: Save
ar: حفظ

# termsAndCondition
source: Terms And Conditions
ar: الشروط والأحكام

source: Privacy Policy
ar: سياسة الخصوصية

source: Full Name
ar: الاسم الكامل

source: Email (optional)
ar: البريد الإلكتروني (اختياري)

source: Date of Birth (optional)
ar: تاريخ الميلاد (اختياري)

source: Invalid Email!
ar: البريد الإلكتروني غير صالح!

# customerSupportText
source: If you have any questions, contact us on our
ar: إذا كان لديك أي أسئلة ، فاتصل بنا على موقعنا

source: Customer Support
ar: دعم العملاء

source: Done
ar: تم

source: Driver license number
ar: رقم رخصة القيادة

# expirationDate
source: Date of Expiration
ar: تاريخ انتهاء الصلاحية

# driverLicensePhoto
source: Photo of driver license
ar: صورة رخصة القيادة

# frontCarLicense
source: The front of car’s license
ar: الجزء الأمامي من رخصة السيارة

# backCarLicense
source: The back of car’s license
ar: الجزء الخلفي من رخصة السيارة

# frontDriverLicense
source: The front of driver’s license
ar: الجزء الأمامي من رخصة القيادة

# backDriverLicense
source: The back of driver’s license
ar: الجزء الخلفي من رخصة القيادة

# addPhoto
source: Add a photo
ar: أضف صورة

# idConfirmation1
source: Bring the driver’s license in front of you and take a photo as an example and the photo should :
ar: أحضر رخصة القيادة أمامك والتقط صورة كمثال والصورة يجب أن:

# idConfirmation2
source: Clearly show the face and your driver’s license.
ar: أظهر بوضوح الوجه ورخصة القيادة الخاصة بك.

# idConfirmation3
source: Must be taken in good light.
ar: يجب أن يؤخذ في ضوء جيد.

# certificateOfGoodConductLink
source: Learn how to obtain a criminal record online
ar: تعرف على كيفية الحصول على سجل إجرامي عبر الإنترنت

source: Vehicle Info
ar: معلومات السيارة

source: Vehicle number
ar: رقم السيارة

source: Vehicle Brand
ar: ماركة السيارة

source: Vehicle Model
ar: موديل السيارة

source: Vehicle Color
ar: لون السيارة

source: Location
ar: الموقع

# numberPlatePhoto
source: Photo of number plate
ar: صورة لوحة الأرقام

# vehiclePhoto
source: Photo of Vehicle
ar: صورة المركبة

source: Vehicle registration certificate
ar: شهادة تسجيل المركبة

# vehicleBrandSearch
source: What brand are you looking for..
ar: ما العلامة التجارية التي تبحث عنها ..

# vehicleModelSearch
source: What model are you looking for..
ar: ما هو الموديل الذي تبحث عنه ..

source: Beige
ar: بيج

source: Black
ar: أسود

source: Blue
ar: أزرق

source: Brown
ar: بني

source: Burgundy
ar: بورجوندي

# darkGrey
source: Dark gray
ar: رمادي غامق

source: Gray
ar: رمادي

source: Green
ar: أخضر

source: Light blue
ar: أزرق فاتح

source: Orange
ar: برتقالي

source: Pink
ar: لون القرنفل

source: Purple
ar: أرجواني

source: Red
ar: أحمر

source: White
ar: أبيض

source: Yellow
ar: أصفر

source: Bronze
ar: برونزية

source: Gold
ar: ذهبي

source: Silver
ar: فضي

source: Photo of Number plate
ar: صورة لوحة الأرقام

# frontCertificate
source: The front of certificate
ar: الجزء الأمامي من الشهادة

# backCertificate
source: The back of certificate
ar: الجزء الخلفي من الشهادة

source: Obtain Criminal Record
ar: الحصول على السجل الجنائي

source: National ID number
ar: رقم الهوية الوطنية

# frontNational
source: The front of National ID
ar: واجهة بطاقة الرقم القومي

# backNational
source: The back of National ID
ar: ظهر بطاقة الرقم القومي

source: Refine location
ar: حدد الموقع

source: Area
ar: منطقة

source: Street
ar: شارع

source: Building number
ar: رقم المبنى

source: Places
ar: أماكن

# placesSearch
source: What Address looking for..
ar: ما العنوان الذي تبحث عنه ..

source: Search...
ar: ابحث...

# phoneCodeSelect
source: Select your phone code
ar: حدد رمز هاتفك

source: Gallery
ar: صالة عرض

source: Camera
ar: آلة تصوير

source: Notification
ar: الإشعارات

source: Request
ar: الطلبات

source: History
ar: السجل

source: Wallet
ar: المحفظة

source: Earning
ar: المكسب

source: Points
ar: النقاط

source: Settings
ar: الإعدادات

source: Invite friends
ar: ادعو أصدقاء

source: Subscriptions
ar: الاشتراكات

source: Logout
ar: تسجيل خروج

source: Profile
ar: حساب تعريفي

source: Silver Level
ar: المستوى الفضي

# goldenLevel
source: Gold Level
ar: المستوى الذهبي

source: Platinum Level
ar: المستوى البلاتيني

source: Diamond level
ar: المستوى الماسي

source: How to use
ar: كيف تستعمل

# earn1PointEveryTrip
source: Earn 1 point for every trip, Earn bonus points for rides done at a specific time Progress over the past 3 months
ar: اكسب نقطة واحدة لكل رحلة ، واكسب نقاط إضافية مقابل المشاوير التي تم إجراؤها في وقت محدد ، وتقدم على مدار الأشهر الثلاثة الماضية

# maintainService
source: Maintain your excellent service
ar: حافظ على خدمتك الممتازة

# keepHighRating
source: Keep your star rating high and cancellation rate low to enjoy more rewards
ar: حافظ على تصنيف النجوم الخاص بك مرتفعًا ومعدل الإلغاء منخفضًا للتمتع بمزيد من المكافآت

source: Star reviews
ar: تقييمات النجوم

source: Trip cancellation rate
ar: معدل إلغاء الرحلة

source: Your Bonus
ar: مكافأتك

# yourPointsEvaluation
source: Your points, evaluation, and cancellation rate will be determined over a period of 3 months (as long as you maintain your distinguished level of providing your service)
ar: سيتم تحديد نقاطك وتقييمك ومعدل الإلغاء خلال فترة 3 أشهر (طالما أنك تحافظ على مستواك المتميز في تقديم خدمتك)

# countPoints
source: {val} Points
ar: {val} نقاط

# threeMonthPeriod
source: period of 3 months
ar: فترة 3 أشهر

# pointsCalculation
source: Points are calculated during fixed periods of several months, and the points are calculated again after the end of each period\n\n\n\n And when you score enough points to reach the second level of rewards, you will start enjoying the new rewards immediately.
ar: يتم احتساب النقاط خلال فترات ثابتة من عدة أشهر ، ويتم احتساب النقاط مرة أخرى بعد نهاية كل فترة \ n \ n \ n \ n وعندما تسجل نقاطًا كافية للوصول إلى المستوى الثاني من المكافآت ، ستبدأ في الاستمتاع بالمكافآت الجديدة على الفور.

# subscriptionType
source: Subscription
ar: الاشتراك

# commissionType
source: Commission
ar: عمولة

# subscriptionAndCommissionType
source: Subscription and Commission
ar: الاشتراك والعمولة

# inviteFriendsToGetReward
source: Invite friends to get rewards
ar: ادعُ الأصدقاء للحصول على مكافآت

# sendInviteFriendCoupon
source: Send the Coupon
ar: أرسل الكوبون

# notificationsSetting
source: Notifications
ar: الإشعارات

# messagesSetting
source: Messages
ar: الرسائل

# darkModeSetting
source: Dark Mode
ar: الوضع الداكن

# languageSetting
source: Language
ar: اللغة

source: Health insurance
ar: التأمين الصحي

source: Family insurance
ar: تأمين الأسرة

source: Bank loan
ar: قرض مصرفي

source: Free fuel shipping
ar: شحن وقود مجاني

source: Discounts
ar: الخصومات

source: Silver level bonus
ar: مكافأة المستوى الفضي

source: Level up for more bonus
ar: رفع المستوى للحصول على المزيد من المكافآت

source: Previous trips
ar: الرحلات السابقة

source: Previous earns
ar: المكاسب السابقة

# dailyProfit
source: Daily profits
ar: أرباح يومية

source: Trips
ar: رحلات

# tripCounter
source: {counter} trips
ar: {counter} رحلات

# onlineHours
source: Online hrs
ar: ساعات العمل

source: Cash Trips
ar: الرحلات النقدية

source: Trip Fares
ar: أسعار الرحلات

source: App Fees
ar: رسوم التطبيق

source: Tax
ar: الضريبة

source: Tolls
ar: الرسوم

source: Discount
ar: التخفيض

source: Top up added
ar: تمت إضافة شحن الرصيد

source: Total Earning
ar: مجموع الأرباح

# availableBalance
source: Balance Available
ar: الرصيد متاح

# walletRecharge
source: recharge +
ar: شحن رصيد +

source: Today
ar: اليوم

# tripsCompletedCounter
source: Has been completed ( {counter} trips )
ar: اكتمل ( {counter} رحلات )

# upgradePointsCalculation
source: Get another 90 points to reach the gold level
ar: احصل على 90 نقطة أخرى للوصول إلى مستوى الذهب

source: Promotions
ar: الترقيات

# promotionsText
source: Participate in this promotion to earn more income
ar: شارك في هذا العرض الترويجي لكسب المزيد من الدخل

source: Click for more
ar: انقر للحصول على المزيد

# notConnected
source: You are not connected!
ar: أنت غير متصل!

source: Start
ar: إبدأ

source: Warning
ar: تحذير

# upPaidSubscription
source: The subscription for the month of {month} has not been paid.
ar: لم يتم دفع الاشتراك لشهر {month}.

# seeDrivingTime
source: See the driving time
ar: رؤية وقت القيادة

# walletWithdraw
source: withdraw
ar: اسحب

# subscriptionWeekly
source: Weekly Subscription
ar: الاشتراك الأسبوعي

# subscriptionMonthly
source: Monthly Subscription
ar: الاشتراك الشهري

# subscriptionFeatureCityRides
source: City rides
ar: جولات المدينة

# subscriptionFeatureCityToCity
source: City to city
ar: من مدينة إلى مدينة

# subscriptionFeatureReservationOfHour
source: Reservation of hour
ar: حجز بالساعة

# subscriptionFeatureCustomisedPrice
source: Customized Price
ar: سعر مخصص

source: City to City
ar: من مدينة إلى مدينة

source: Reservation of hour
ar: حجز بالساعة

# weeklySubscriptionText
source: will be deducted {fees} SAR from your wallet from the beginning of the subscription day of each month
ar: سيتم خصم {fees} ريال سعودي من محفظتك من بداية الاشتراك يوم من كل شهر

source: Features Offered
ar: الميزات المقدمة

# servicesCanJoin
source: All services you can Joined
ar: جميع الخدمات التي يمكنك الانضمام إليها

source: Subscribe
ar: اشترك

# weeklySubscribeErr
source: You have not chosen any feature
ar: لم تختر أي ميزة

# rewardOffered
source: Rewards offered to you
ar: المكافآت المقدمة لك

source: Choose your city
ar: اختر مدينتك

source: Choose city you can go to
ar: اختر المدينة التي يمكنك الذهاب إليها

source: Choose another city you can go to
ar: اختر مدينة أخرى يمكنك الذهاب إليها

source: when
ar: متى

source: Number of hours
ar: عدد الساعات

source: Hour price
ar: سعر الساعة

source: Send Message
ar: أرسل رسالة

source: Request Rides
ar: طلب مشاوير

source: Close
ar: غلق

source: Send
ar: ارسل

source: Price Offer
ar: سعر العرض

# suggestPrice
source: Suggest a price
ar: اقترح السعر

source: Cash
ar: نقدي

# rateSeda
source: Rate your experience for Seda
ar: قيم تجربتك مع سيدا

source: More
ar: أكثر

source: Completed
ar: اكتمل

source: Cancelled
ar: ألغيت

source: You connected!
ar: أنت متصل!

# away
source: ( {time} ) away
ar: ( {time} بعيد )

source: Arrived
ar: وصلت

source: Start the trip
ar: ابدأ الرحلة

source: End the trip
ar: إنهِ الرحلة

source: View the receipt
ar: اعرض الإيصال

source: Cancel
ar: الغي

source: Subtotal
ar: المحصلة

source: Receipt for the trip
ar: إيصال الرحلة

source: Reload Page
ar: إعادة تحميل الصفحة

# noInternet
source: Ops! No Internet Connection
ar: عذرًا! لا يوجد اتصال بالإنترنت

# slowOrNoInternet
source: Slow or no internet connection.Please check your internet
ar: اتصال إنترنت بطيء أو معدوم. الرجاء التحقق من الإنترنت لديك

source: Sign In
ar: تسجيل الدخول

source: OR
ar: أو

# phone
source: Phone Number
ar: رقم التليفون

source: Next
ar: التالي

# verify
source: Phone Verification
ar: التحقق من الهاتف

# otpCode
source: Enter your OTP code here
ar: أدخل رمز OTP الخاص بك هنا

# codeSent
source: Verification Code Sent Successfully
ar: تم إرسال رمز التحقق بنجاح

# cont
source: Continue
ar: اكمل

source: Search PLaces
ar: أماكن البحث

source: No Avail Vehicle Brands
ar: لا توجد ماركات سيارات متوفرة

source: Fetch Vehicle Brands
ar: إحضار العلامات التجارية للمركبة

source: No Avail Vehicle Models
ar: لا توجد نماذج سيارات متوفرة

source: Fetch Vehicle Models
ar: إحضار نماذج المركبات

source: No Avail Vehicle Colors
ar: لا تتوفر ألوان السيارة

source: Fetch Vehicle Colors
ar: إحضار ألوان السيارة

source: No Avail Predictions
ar: لا توجد تنبؤات متوفرة

# fillProfile
source: Fill Your Profile
ar: املأ ملف التعريف الخاص بك

# nickName
source: NickName (optional)
ar: الكنية (خياري)

source: Email
ar: البريد الإلكتروني

# birthDate
source: Date of Birth (optional)
ar: تاريخ الميلاد (خياري)

# termsApprove
source: Agree to The Terms and Conditions
ar: وافق على الشروط والأحكام

# enterName
source: Please Enter Your Name
ar: من فضلك أدخل إسمك

# shortName
source: Name Must be More than 6 Characters
ar: يجب أن يكون الاسم أكثر من 6 أحرف

# needToAgree
source: You Need to Agree to The Terms
ar: أنت بحاجة إلى الموافقة على الشروط

source: Ride
ar: الرحلة

# termsAndPolicy
source: Terms & Privacy Policy
ar: الشروط وسياسة الخصوصية

# govern
source: Governorates
ar: المحافظات

source: Where To?
ar: إلى أين ؟

source: Now
ar: الآن

source: Edit
ar: تعديل

source: Go
ar: اذهب

source: Home
ar: الرئيسية

source: Good Morning 👋
ar: صباح الخير 👋

source: My Wallet
ar: محفظتى

source: Wallet Balance
ar: رصيد المحفظة

source: Cards
ar: البطاقات

source: Language
ar: اللغة

# selectLocation
source: You must select location on map
ar: يجب عليك تحديد الموقع على الخريطة

source: Select
ar: اختار

source: Select Ride
ar: حدد رحلة

source: Add One
ar: أضف واحدا

# addFavourite
source: Add This Location To Favourites?
ar: أضف هذا الموقع إلى المفضلة ؟

source: Stop Point
ar: نقطة التوقف

source: Start Point
ar: نقطة البداية

# whyCancel
source: Please tell us why you need to
ar: من فضلك قل لنا لماذا تحتاج إلى ؟

source: Cancel Trip
ar: إلغاء الرحلة

# personalReason
source: Personal reasons
ar: اسباب شخصية

# anotherCarArrived
source: Another car arrived faster
ar: وصلت سيارة أخرى بشكل أسرع

# reasonRelatedTo
source: Reasons related to the
ar: الأسباب المتعلقة ب

# capOrCar
source: captain/car
ar: قائد/سيارة

# sedaSorry
source: Seda Is Sorry For You
ar: سيدا آسف لك

source: Yes
ar: نعم

source: No
ar: لا

# playAudioRecord
source: Play Audio Recording
ar: تشغيل تسجيل الصوت

# designTextExample
source: This Text is An Example
ar: هذا النص مثال

# rideStarted
source: The Trip has Begun
ar: الرحلة بدأت

# capProf
source: Captain Profile
ar: الملف الشخصي للكابتن

source: Car Type
ar: نوع السيارة

source: End
ar: انهاء

source: My Cards
ar: بطاقاتي

# emptyCards
source: No Cards here yet Let's Add One
ar: لا توجد بطاقات هنا حتى الآن دعونا نضيف واحدة

# addCard
source: Add New Card
ar: إضافة بطاقة جديدة

# savedCards
source: Your Saved Cards
ar: بطاقاتك المحفوظة

source: Error .. !
ar: خطأ .. !

source: Checkout
ar: الدفع

source: DISTANCE
ar: المسافة

source: TIME
ar: الوقت

source: SPECIAL
ar: خاص

# tripDate
source: Trip Date: {date}
ar: تاريخ الرحلة: {date}

source: Total Price
ar: السعر الكلي

source: Rate Driver
ar: تقييم السائق

# rideTypesError
source: Error Fetching Ride Types
ar: خطأ في تحديد أنواع الرحلة

source: Confirm
ar: تأكيد

# addressConf
source: Are you sure about the address
ar: هل أنت متأكد من العنوان ؟

# checkDrId
source: Check the vehicle and driver's identity
ar: التحقق من هوية السيارة والسائق

source: Trip Start
ar: بدء الرحلة

source: Trip Location
ar: موقع الرحلة

source: Trip Time
ar: وقت الرحلة

source: Arrival Time
ar: وقت الوصول

source: Price
ar: السعر

# sedaServe
source: Seda hope to serve you to the fullest
ar: تأمل سيدا في خدمتك على أكمل وجه

# periodStop
source: Please commit to a period not exceeding 3 minutes for each stopping point
ar: الرجاء الالتزام بفترة لا تتجاوز 3 دقائق لكل نقطة توقف

# periodStopDesc
source: In order to estimate the driver’s time, please specify a stop for each stopping point that does not exceed 3 minutes. If otherwise, the price of the trip will change.
ar: لتقدير وقت السائق ، يرجى تحديد توقف لكل نقطة توقف لا تتجاوز 3دقائق. إذا كان خلاف ذلك ، سيتغير سعر الرحلة.

source: Finish
ar: انهاء

# sedaOpinion
source: What do you think of the Seda?
ar: ما رأيك في سيدا ؟

# inviteFriendsGift
source: Invite friends to get rewards
ar: ادعُ الأصدقاء للحصول على مكافآت

source: OFF
ar: عن

# moreTrips
source: more than a journey
ar: أكثر من رحلة

# errorOccurred
source: error has occurred
ar: حدث خطأ

# doNotHave
source: you don't have any
ar: ليس لديك أي منها

# validCoupon
source: A valid coupon with the best discount is automatically applied to your trip fare
ar: يتم تطبيق قسيمة صالحة مع أفضل خصم تلقائيًا على أجرة رحلتك

# myPromos
source: My Promo Codes
ar: أكوادي الترويجية

source: Notifications
ar: اشعارات

# cong
source: Congratulations!
ar: تهانينا

# facilitateText
source: This text is a test script to facilitate the user experience service
ar: هذا النص هو برنامج نصي تجريبي لتسهيل خدمة تجربة المستخدم!

source: Payment
ar: الدفع

source: Recharge
ar: شحن رصيد

# credit
source: Credit Card
ar: بطاقة إئتمان

source: Save Changes
ar: حفظ التغييرات

# around
source: Around You
ar: حولك

# favPlaces
source: Favorite Places
ar: الأماكن المفضلة

source: My Vouchers
ar: قسائمي الشرائيه

# promoAdded
source: Promo Code Added Successfully
ar: تمت إضافة الرمز الترويجي بنجاح

source: APPLY
ar: قدم

# qrScan
source: Scan QR Code to Start
ar: امسح رمز الاستجابة السريعة للبدء

# qrScanText
source: The QR code will be automatically detected when you position it between the guide lines
ar: سيتم اكتشاف رمز الاستجابة السريعة تلقائيًا عند وضعه بين خطوط الدليل

source: Open Flash
ar: افتح الفلاش

# addCode
source: Write Code
ar: اكتب كود

source: Choose Ride
ar: اختر ركوب

source: Choose
ar: اختار

# choosePayment
source: Choose The Payment Method
ar: اختر طريقة الدفع

source: Online
ar: متصل

# rideRequested
source: Ride Requested Successfully
ar: تم طلب الرحلة بنجاح

source: Messages
ar: رسائل

source: Security
ar: حماية

source: Contact Us
ar: اتصل بنا

# terms
source: Terms and Conditions
ar: الأحكام والشروط

# termsText
source: Terms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and ConditionsTerms and Conditions
ar: الشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالأحكام والشروط الشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالأحكام والشروط الشروط الشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالأحكام والشروط الشروط الشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالأحكام والشروط الشروط الشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكامالشروط والأحكام

source: Your Trip
ar: رحلتك

source: Add Coin
ar: أضف عملة

# cardName
source: Name on Card
ar: الاسم على البطاقة

source: Card Number
ar: رقم البطاقة

# exprDate
source: Expiry Date
ar: تاريخ الانتهاء

source: New Passenger
ar: راكب جديد

source: Me
ar: أنا

# friendsAgreed
source: When You clicking on the option, you confirm that your friend agrees to share his contact information
ar: عند النقر فوق الخيار ، فإنك تؤكد أن صديقك يوافق على مشاركة معلومات الاتصال الخاصة به

# compDisabled
source: Disable compatibility with the captain
ar: تعطيل التوافق مع السائق

# capRequestSent
source: Your request will not be sent to the captain if you agree with him. For assistance, contact us
ar: لن يتم إرسال طلبك إلى القبطان إذا كنت توافق عليه. للحصول على المساعدة ، اتصل بنا

source: Disabled
ar: معطل

# takePic
source: Take Picture
ar: التقط صورة

# selectGallery
source: Select From Gallery
ar: حدد من المعرض

# locationAdd
source: Location Address
ar: عنوان المنطقة

# leftWindowClosed
source: He left the windows closed
ar: ترك النوافذ مغلقة

# carCond
source: Car condition
ar: حالة السيارة

# impol
source: Impolite
ar: غير مهذب

# arrLate
source: Arrived late
ar: وصل متأخرا

# badDrive
source: Bad driving
ar: قيادة سيئة

# leaveComment
source: Leave a Comment
ar: اترك تعليقا

source: Write Price
ar: اكتب السعر

# safetyWelcome
source: Welcome to the Safety Center in Side
ar: مرحبًا بك في مركز الأمان في سيدا

# tripShare
source: Share the Trip
ar: شارك الرحلة

# recordingAudio
source: Recording audio during the ride
ar: تسجيل الصوت أثناء الركوب
