Repository: AhmedShawkyAhmed/SedaDriver
Catalog: lib/src/constants/localization/l10n/app_*.arb
Languages: ar

# safetyText1
source: Safety above all else Turn on the audio recording for safety
ar: الأمان قبل كل شيء شغّل التسجيل الصوتي من أجل الأمان

# rideVerify
source: Instant Ride Verification
ar: التحقق الفوري من الرحلة

# safetyText2
source: Your consultations are tracked in real time while you're on the go
ar: يتم تعقب الاستشارات الخاصة بك في الوقت الحقيقي أثناء التنقل

# sedaHotline
source: Hotline in Seda
ar: الخط الساخن في سيدا

# safetyText3
source: We are here for you anytime, anywhere
ar: نحن هنا من أجلك في أي وقت وفي أي مكان

# trustedCont
source: Trusted Contacts
ar: جهات الاتصال الموثوقة

# safetyText4
source: Safety above all else Turn on the audio recording for safety
ar: الأمان قبل كل شيء شغّل التسجيل الصوتي من أجل الأمان

source: Usage Time
ar: وقت الاستخدام

# whiteThing
source: Write something
ar: أكتب شيئا

# micAllow
source: you should allow mic
ar: يجب أن تسمح للميكروفون

source: Send Offer
ar: إرسال العرض

# waitUserAccept
source: Waiting for user acceptance
ar: في انتظار قبول المستخدم

# newT
source: New
ar: جديد

# appLangCh
source: App Language Change
ar: تغيير لغة التطبيق

# appLangChErrAr
source: Current Language is Arabic Already
ar: اللغة الحالية هي العربية بالفعل

# appLangChErrEn
source: Current Language is English Already
ar: اللغة الحالية هي الإنجليزية بالفعل

# appLangChErrEmpty
source: You Can't Confirm Without Selecting Language
ar: لا يمكنك التأكيد بدون تحديد اللغة

source: Arabic
ar: عربي

source: English
ar: إنجليزي

# shortPhone
source: Incorrect phone number
ar: رقم الهاتف غير صحيح

# joinSeda
source: Referrals to join Seda
ar: إحالات للانضمام إلى سيدا

source: Message
ar: رسالة

source: Driver Offer
ar: عرض السائق

# driverOffline
source: You Are Offline Change To Online To to show Trips
ar: أنت غير متصل بالتغيير إلى متصل لإظهار الرحلات

# makeSure
source: Make Sure the Customer
ar: تأكد من العميل

# rideOpinion
source: How Was your Last Ride?
ar: كيف كانت رحلتك الأخيرة؟

# designLongTextExample
source: This Text is an Example,This Text is an Example,This Text is an Example,This Text is an Example
ar: هذا النص مثال ، هذا النص مثال ، هذا النص مثال ، هذا النص مثال

# drCancelRide
source: You Canceled The Ride
ar: لقد ألغيت الركوب

# prevEarnings
source: Previous earnings
ar: الأرباح السابقة

# prevTrips
source: Previous trips
ar: الرحلات السابقة

# tripNumber
source: {num} Trip
ar: {num} رحلة

source: Online hrs
ar: ساعات العمل

source: Cash Trip
ar: رحلة نقدية

# topUp
source: Top up Added
ar: تمت إضافة تعبئة الرصيد

source: Paid
ar: مدفوع

# vehicleYear
source: Vehicle Purchase Year
ar: سنة شراء السيارة

# vehicleCompany
source: Vehicles Companies
ar: شركات المركبات

# vehicleCompanyType
source: Vehicles Company Types
ar: أنواع شركات المركبات

source: Pick Vehicle Color
ar: اختر لون السيارة

# drLicense
source: Driver License
ar: رخصة قيادة

source: Vehicle License
ar: رخصة المركبة

source: Tax License
ar: الترخيص الضريبي

# enterCarNumError
source: Please Enter Car Number
ar: الرجاء إدخال رقم السيارة

# enterCarYearError
source: Please Enter Car Purchase Year
ar: الرجاء إدخال سنة شراء السيارة

# selectVehicleTypeError
source: Please Choose a Vehicle Company and Type
ar: الرجاء اختيار شركة السيارات والنوع

# pickVehicleColorError
source: Please Pick Vehicle Color
ar: الرجاء اختيار لون السيارة

# enterDriverLicenseError
source: Please Pick Driver License
ar: الرجاء اختيار رخصة القيادة

# enterVehicleLicenseError
source: Please Pick Vehicle License
ar: الرجاء اختيار رخصة السيارة

# enterTaxLicenseError
source: Please Pick Tax License
ar: الرجاء اختيار الترخيص الضريبي

# termsError
source: You Need to Agree to The Terms
ar: أنت بحاجة إلى الموافقة على الشروط

# package
source: From {from} Trip To {to} Trips Cost {cost}
ar: من {from} رحلة إلى {to} تكلفة الرحلات {cost}

# subPlans
source: Subscription Plans
ar: خطط الاشتراك

source: Ratings
ar: التقييمات

# date
source: Date : {date}
ar: تاريخ : {date}

# day
source: Day : {day}
ar: يوم : {day}

# placeTooFar
source: The meeting place is too far
ar: مكان الاجتماع بعيد جدًا

# wrongPoint
source: wrong meeting point
ar: نقطة التقاء خاطئة

# passengerAsk
source: The passenger asked for it
ar: طلب الراكب ذلك

# stillOnRoad
source: I'm still on the road
ar: ما زلت على الطريق

# notEnoughSeat
source: Not enough seats
ar: مقاعد غير كافية

# tooMuchBag
source: Too much baggage
ar: الكثير من الأمتعة

# safetyReason
source: For safety reasons
ar: لأسباب تتعلق بالسلامة

source: Vehicle Color Picker:
ar: منتقي لون السيارة:

# seeDetails
source: See all Details
ar: مشاهدة كافة التفاصيل

# priceOfferReq
source: Offer Price Required!
ar: سعر العرض مطلوب!

source: Total Trips
ar: إجمالي الرحلات

source: Cancel Offer
ar: إلغاء العرض

# micPermissionError
source: Microphone permission must be granted!!!
ar: يجب منح إذن الميكروفون!!!

# storagePermissionError
source: Storage Permission must be granted!!!
ar: يجب منح إذن التخزين!!!

# recordPermissionsError
source: You can't send voice without allow Seda record permissions
ar: لا يمكنك إرسال صوت بدون السماح لأذونات تسجيل Seda

source: Rate User
ar: قيم المستخدم

source: Rate The User
ar: قيم المستخدم

# didThereAnyChange
source: Did the user have any change ?
ar: هل هناك باقي المستخدم ؟

# areThereFeesLeft
source: Are there any changes left?
ar: هل هناك أي باقي للمستخدم ؟

# ifFoundWritePriceHere
source: write money,you took, here, then click Done
ar: اكتب النقود التي أخذتها, ثم اضغط تم

source: Submit
ar: تأكيد

source: Edit Profile
ar: تعديل الملف الشخصي

source: Services
ar: الخدمات

# tryReachHigherLevel
source: Try to reach a higher level
ar: حاول الوصول إلى مستوى أعلى

source: Accepting Order
ar: قبول الطلب

source: Rejecting Order
ar: الطلب المرفوض

# swipeDownCancel
source: Swipe down to cancel
ar: اسحب لأسفل للإلغاء

# swipeUpAccept
source: Swipe up to accept
ar: اسحب لأعلى للقبول

source: Rate
ar: التقييم

source: Enter email
ar: أدخل البريد الإلكتروني

# enterBirth
source: Enter date of birth
ar: أدخل تاريخ الميلاد

source: You subscribed successfully
ar: لقد اشتركت بنجاح

source: Some error happened try again
ar: حدث خطأ ما حاول مرة أخرى

source: renew
ar: تجديد

source: upgrade
ar: ترقية

# hourDay
source: Hours / Day
ar: ساعات / يوم

source: Cancellation
ar: معدل الالغاء

source: Levels
ar: المستوي

source: Transaction
ar: المعاملة

source: Transactions
ar: المعاملات

source: Stop
ar: ايقاف

source: Upcoming promotional ads
ar: الإعلانات الترويجية القادمة

source: No history here.
ar: لا سجلات هنا

# doYouWantCancelTrip
source: Do you want to cancel the trip ?
ar: هل تريد انهاء الرحلة ؟

source: record
ar: تسجيل

# enterValidAmount
source: enter validA amount of money
ar: أدخل قيمة صحيحة

# privacyPolicyContent
source: Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. Richard McClintock, a Latin professor at Hampden-Sydney College in Virginia, looked up one of the more obscure Latin words, consectetur, from a Lorem Ipsum passage, and going through the cites of the word in classical literature, discovered the undoubtable source. Lorem Ipsum comes from sections 1.10.32 and 1.10.33 of 'de Finibus Bonorum et Malorum' (The Extremes of Good and Evil) by Cicero, written in 45 BC. This book is a treatise on the theory of ethics, very popular during the Renaissance. The first line of Lorem Ipsum, 'Lorem ipsum dolor sit amet..', comes from a line in section 1.10.32.
ar: خلافاً للاعتقاد الشائع، فإن لوريم إيبسوم ليس مجرد نص عشوائي. لها جذور في قطعة من الأدب اللاتيني الكلاسيكي من 45 قبل الميلاد، مما يجعلها أكثر من 2000 سنة. قام ريتشارد مكلينتوك، أستاذ اللغة اللاتينية في كلية هامبدن سيدني في فيرجينيا، بالبحث عن واحدة من أكثر الكلمات اللاتينية غموضًا، وهي consectetur، من مقطع لوريم إيبسوم، ومن خلال تصفح مراجع الكلمة في الأدب الكلاسيكي، اكتشف المصدر الذي لا شك فيه. يأتي نص لوريم إيبسوم من الأقسام 1.10.32 و1.10.33 من كتاب "de Finibus Bonorum et Malorum" (أقصى الخير والشر) لشيشرون، والذي كتبه عام 45 قبل الميلاد. هذا الكتاب عبارة عن أطروحة عن نظرية الأخلاق، والتي حظيت بشعبية كبيرة خلال عصر النهضة. السطر الأول من لوريم إيبسوم، 'Lorem ipsum dolor sit amet..'، يأتي من سطر في القسم 1.10.32. "
